// var allDiv=document.querySelectorAll('.card-div');
// console.log(allDiv);

var ShriGaneshAarti=`<h3 class="arti-text-div">श्रीगणेश जी की आरती</h3>
<pre>

जय गणेश जय गणेश जय गणेश देवा।
माता जाकी पार्वती पिता महादेवा॥

एक दंत दयावंत, चार भुजा धारी।
माथे पर तिलक सोहे, मूसे की सवारी॥

जय गणेश जय गणेश जय गणेश देवा।
माता जाकी पार्वती पिता महादेवा॥

अंधन को आंख देत, कोढ़िन को काया।
बांझन को पुत्र देत, निर्धन को माया॥

जय गणेश जय गणेश जय गणेश देवा।
माता जाकी पार्वती पिता महादेवा॥

पान चढ़े, फूल चढ़े, और चढ़े मेवा।
लड़ुअन का भोग लगे, संत करें सेवा॥

जय गणेश जय गणेश जय गणेश देवा।
माता जाकी पार्वती पिता महादेवा॥

अपने नैनन जड़तु हैं,
अरु धन धान्य सुख सम्रिद्धि जो कोई नहीं जानत, 
तुम्हारी शरण लें सबकी लाज अधिकारी तुम गणपति जी की आरती जय गणेश देवा॥

जय गणेश जय गणेश जय गणेश देवा।
माता जाकी पार्वती पिता महादेवा॥</pre>`;

var hanumanAarti=`<h3 class="arti-text-div">हनुमान  जी की आरती</h3>
<pre>
आरती कीजै हनुमान लला की ।
दुष्ट दलन रघुनाथ कला की ॥

जाके बल से गिरवर काँपे ।
रोग-दोष जाके निकट न झाँके ॥
अंजनि पुत्र महा बलदाई ।
संतन के प्रभु सदा सहाई ॥
आरती कीजै हनुमान लला की ॥

दे वीरा रघुनाथ पठाए ।
लंका जारि सिया सुधि लाये ॥
लंका सो कोट समुद्र सी खाई ।
जात पवनसुत बार न लाई ॥
आरती कीजै हनुमान लला की ॥

लंका जारि असुर संहारे ।
सियाराम जी के काज सँवारे ॥
लक्ष्मण मुर्छित पड़े सकारे ।
लाये संजिवन प्राण उबारे ॥
आरती कीजै हनुमान लला की ॥

पैठि पताल तोरि जमकारे ।
अहिरावण की भुजा उखारे ॥
बाईं भुजा असुर दल मारे ।
दाहिने भुजा संतजन तारे ॥
आरती कीजै हनुमान लला की ॥

सुर-नर-मुनि जन आरती उतरें ।
जय जय जय हनुमान उचारें ॥
कंचन थार कपूर लौ छाई ।
आरती करत अंजना माई ॥
आरती कीजै हनुमान लला की ॥

जो हनुमानजी की आरती गावे ।
बसहिं बैकुंठ परम पद पावे ॥
लंक विध्वंस किये रघुराई ।
तुलसीदास स्वामी कीर्ति गाई ॥

आरती कीजै हनुमान लला की ।
दुष्ट दलन रघुनाथ कला की ॥
॥ इति संपूर्णंम् ॥
</pre>`;
var ShivAarti=`<h3 class="arti-text-div">शिव जी की आरती</h3>
<pre>
ॐ जय शिव ओंकारा… आरती
जय शिव ओंकारा, ॐ जय शिव ओंकारा ।
ब्रह्मा, विष्णु, सदाशिव, अर्द्धांगी धारा ॥
ॐ जय शिव ओंकारा

एकानन चतुरानन पंचानन राजे ।
हंसासन गरूड़ासन वृषवाहन साजे ॥
ॐ जय शिव ओंकारा

दो भुज चार चतुर्भुज दसभुज अति सोहे ।
त्रिगुण रूप निरखते त्रिभुवन जन मोहे ॥
ॐ जय शिव ओंकारा

अक्षमाला वनमाला मुण्डमाला धारी ।
त्रिपुरारी कंसारी कर माला धारी ॥
ॐ जय शिव ओंकारा

ॐ जय शिव ओंकारा
सुखकारी दुखहारी जगपालन कारी ॥
कर के मध्य कमंडलु चक्र त्रिशूलधारी ।

ॐ जय शिव ओंकारा
सनकादिक गरुणादिक भूतादिक संगे ॥
श्वेतांबर पीतांबर बाघंबर अंगे ।

ब्रह्मा विष्णु सदाशिव जानत अविवेका ।
प्रणवाक्षर में शोभित ये तीनों एका ॥
ॐ जय शिव ओंकारा

लक्ष्मी व सावित्री पार्वती संगा ।
पार्वती अर्द्धांगी, शिवलहरी गंगा ॥
ॐ जय शिव ओंकारा

त्रिगुणस्वामी जी की आरती जो कोइ नर गावे ।
कहत शिवानंद स्वामी सुख संपति पावे ॥
ॐ जय शिव ओंकारा। 
</pre>`;
var laxmiAarti=`<h3 class="arti-text-div">लक्ष्मी  जी की आरती</h3>
<pre>
मां लक्ष्‍मी की आरती
मां लक्ष्‍मी की आरती
ॐ जय लक्ष्मी माता,
मैया जय लक्ष्मी माता ।
तुमको निसदिन सेवत,
हर विष्णु विधाता ॥
उमा, रमा, ब्रम्हाणी,
तुम ही जग माता ।
सूर्य चद्रंमा ध्यावत,
नारद ऋषि गाता ॥
॥ॐ जय लक्ष्मी माता...॥

दुर्गा रूप निरंजनि,
सुख-संपत्ति दाता ।
जो कोई तुमको ध्याता,
ऋद्धि-सिद्धि धन पाता ॥
॥ॐ जय लक्ष्मी माता...॥

तुम ही पाताल निवासनी,
तुम ही शुभदाता ।
कर्म-प्रभाव-प्रकाशनी,
भव निधि की त्राता ॥
॥ॐ जय लक्ष्मी माता...॥

जिस घर तुम रहती हो,
ताँहि में हैं सद्‍गुण आता ।
सब सभंव हो जाता,
मन नहीं घबराता ॥
।।ॐ जय लक्ष्मी माता...॥

तुम बिन यज्ञ ना होता,
वस्त्र न कोई पाता ।
खान पान का वैभव,
सब तुमसे आता ॥
ॐ जय लक्ष्मी माता...॥

शुभ गुण मंदिर सुंदर,
क्षीरोदधि जाता ।
रत्न चतुर्दश तुम बिन,
कोई नहीं पाता ॥
।।ॐ जय लक्ष्मी माता...॥

महालक्ष्मी जी की आरती,
जो कोई नर गाता ।
उँर आंनद समाता,
पाप उतर जाता ॥
॥ॐ जय लक्ष्मी माता...॥
</pre>`;
var durgaAarti=`<h3 class="arti-text-div">मां दुर्गा जी की आरती</h3>
<pre>
जय अम्बे गौरी, मैया जय श्यामा गौरी।

तुमको निशदिन ध्यावत, हरि ब्रह्मा शिव री।। जय अम्बे गौरी,...।

मांग सिंदूर बिराजत, टीको मृगमद को।

उज्ज्वल से दोउ नैना, चंद्रबदन नीको।। जय अम्बे गौरी,...।

कनक समान कलेवर, रक्ताम्बर राजै।

रक्तपुष्प गल माला, कंठन पर साजै।। जय अम्बे गौरी,...।

केहरि वाहन राजत, खड्ग खप्परधारी।

सुर-नर मुनिजन सेवत, तिनके दुःखहारी।। जय अम्बे गौरी,...।

कानन कुण्डल शोभित, नासाग्रे मोती।

कोटिक चंद्र दिवाकर, राजत समज्योति।। जय अम्बे गौरी,...।

शुम्भ निशुम्भ बिडारे, महिषासुर घाती।

धूम्र विलोचन नैना, निशिदिन मदमाती।। जय अम्बे गौरी,...।

चण्ड-मुण्ड संहारे, शौणित बीज हरे।

मधु कैटभ दोउ मारे, सुर भयहीन करे।। जय अम्बे गौरी,...।

ब्रह्माणी, रुद्राणी, तुम कमला रानी।

आगम निगम बखानी, तुम शिव पटरानी।। जय अम्बे गौरी,...।

चौंसठ योगिनि मंगल गावैं, नृत्य करत भैरू।

बाजत ताल मृदंगा, अरू बाजत डमरू।। जय अम्बे गौरी,...।

तुम ही जग की माता, तुम ही हो भरता।

भक्तन की दुःख हरता, सुख सम्पत्ति करता।। जय अम्बे गौरी,...।

भुजा चार अति शोभित, खड्ग खप्परधारी।

मनवांछित फल पावत, सेवत नर नारी।। जय अम्बे गौरी,...।

कंचन थाल विराजत, अगर कपूर बाती।

श्री मालकेतु में राजत, कोटि रतन ज्योति।। जय अम्बे गौरी,...।

अम्बेजी की आरती जो कोई नर गावै।

कहत शिवानंद स्वामी, सुख-सम्पत्ति पावै।। जय अम्बे गौरी,...।

</pre>`;
var sarsavatiAarti=`<h3 class="arti-text-div"> सरस्वती जी की आरती</h3>
<pre>
जय सरस्वती माता,
मैया जय सरस्वती माता ।
सदगुण वैभव शालिनी,
त्रिभुवन विख्याता ॥
जय जय सरस्वती माता...॥
चन्द्रवदनि पद्मासिनि,
द्युति मंगलकारी ।
सोहे शुभ हंस सवारी,
अतुल तेजधारी ॥
जय जय सरस्वती माता...॥

बाएं कर में वीणा,
दाएं कर माला ।
शीश मुकुट मणि सोहे,
गल मोतियन माला ॥
जय जय सरस्वती माता...॥

देवी शरण जो आए,
उनका उद्धार किया ।
पैठी मंथरा दासी,
रावण संहार किया ॥
जय जय सरस्वती माता...॥

विद्या ज्ञान प्रदायिनि,
ज्ञान प्रकाश भरो ।
मोह अज्ञान और तिमिर का,
जग से नाश करो ॥
जय जय सरस्वती माता...॥

धूप दीप फल मेवा,
माँ स्वीकार करो ।
ज्ञानचक्षु दे माता,
जग निस्तार करो ॥
॥ जय सरस्वती माता...॥

माँ सरस्वती की आरती,
जो कोई जन गावे ।
हितकारी सुखकारी,
ज्ञान भक्ति पावे ॥
जय जय सरस्वती माता...॥

जय सरस्वती माता,
जय जय सरस्वती माता ।
सदगुण वैभव शालिनी,
त्रिभुवन विख्याता ॥
</pre>`;






function funShow(valuethis){
    // console.log(valuethis);
    var showArt = document.getElementById("arti");
    var showChalisha = document.getElementById("chalisha");
    var showMantar = document.getElementById("mantar");
   
   
   
   
   
    if(valuethis=='hanuman'){
        // console.log('hanuman');
        showArt.innerHTML=hanumanAarti;

    }
    else if(valuethis=='shriganesh')
    {
        showArt.innerHTML=ShriGaneshAarti;
       
    }
    else if(valuethis=='shiv'){
        showArt.innerHTML=ShivAarti;        
    }
    else if(valuethis=='sarsavati'){
        showArt.innerHTML=sarsavatiAarti;
    }
    else if(valuethis=='laxami'){
        showArt.innerHTML=laxmiAarti;
    }
    else if(valuethis=='duraga'){
        showArt.innerHTML=durgaAarti;
    }

}
// for(let i=0; i<allDiv.length;i++){
//     allDiv[i].addEventListener("click",function(){
        
//     });
// }

