// var allDiv=document.querySelectorAll('.card-div');
// console.log(allDiv);

var ShriGaneshAarti=`<h3 class="arti-text-div ">श्रीगणेश जी की आरती</h3>
<pre class="theme" id="preTag" >

जय गणेश जय गणेश जय गणेश देवा।
माता जाकी पार्वती पिता महादेवा॥

एक दंत दयावंत, चार भुजा धारी।
माथे पर तिलक सोहे, मूसे की सवारी॥

जय गणेश जय गणेश जय गणेश देवा।
माता जाकी पार्वती पिता महादेवा॥

अंधन को आंख देत, कोढ़िन को काया।
बांझन को पुत्र देत, निर्धन को माया॥

जय गणेश जय गणेश जय गणेश देवा।
माता जाकी पार्वती पिता महादेवा॥

पान चढ़े, फूल चढ़े, और चढ़े मेवा।
लड़ुअन का भोग लगे, संत करें सेवा॥

जय गणेश जय गणेश जय गणेश देवा।
माता जाकी पार्वती पिता महादेवा॥

अपने नैनन जड़तु हैं,
अरु धन धान्य सुख सम्रिद्धि जो कोई नहीं जानत, 
तुम्हारी शरण लें सबकी लाज अधिकारी तुम गणपति जी की आरती जय गणेश देवा॥

जय गणेश जय गणेश जय गणेश देवा।
माता जाकी पार्वती पिता महादेवा॥</pre>`;

var hanumanAarti=`<h3 class="arti-text-div">हनुमान  जी की आरती</h3>
<pre class="theme" id="preTag">
आरती कीजै हनुमान लला की ।
दुष्ट दलन रघुनाथ कला की ॥

जाके बल से गिरवर काँपे ।
रोग-दोष जाके निकट न झाँके ॥
अंजनि पुत्र महा बलदाई ।
संतन के प्रभु सदा सहाई ॥
आरती कीजै हनुमान लला की ॥

दे वीरा रघुनाथ पठाए ।
लंका जारि सिया सुधि लाये ॥
लंका सो कोट समुद्र सी खाई ।
जात पवनसुत बार न लाई ॥
आरती कीजै हनुमान लला की ॥

लंका जारि असुर संहारे ।
सियाराम जी के काज सँवारे ॥
लक्ष्मण मुर्छित पड़े सकारे ।
लाये संजिवन प्राण उबारे ॥
आरती कीजै हनुमान लला की ॥

पैठि पताल तोरि जमकारे ।
अहिरावण की भुजा उखारे ॥
बाईं भुजा असुर दल मारे ।
दाहिने भुजा संतजन तारे ॥
आरती कीजै हनुमान लला की ॥

सुर-नर-मुनि जन आरती उतरें ।
जय जय जय हनुमान उचारें ॥
कंचन थार कपूर लौ छाई ।
आरती करत अंजना माई ॥
आरती कीजै हनुमान लला की ॥

जो हनुमानजी की आरती गावे ।
बसहिं बैकुंठ परम पद पावे ॥
लंक विध्वंस किये रघुराई ।
तुलसीदास स्वामी कीर्ति गाई ॥

आरती कीजै हनुमान लला की ।
दुष्ट दलन रघुनाथ कला की ॥
॥ इति संपूर्णंम् ॥
</pre>`;
var ShivAarti=`<h3 class="arti-text-div">शिव जी की आरती</h3>
<pre class="theme" id="preTag">
ॐ जय शिव ओंकारा… आरती
जय शिव ओंकारा, ॐ जय शिव ओंकारा ।
ब्रह्मा, विष्णु, सदाशिव, अर्द्धांगी धारा ॥
ॐ जय शिव ओंकारा

एकानन चतुरानन पंचानन राजे ।
हंसासन गरूड़ासन वृषवाहन साजे ॥
ॐ जय शिव ओंकारा

दो भुज चार चतुर्भुज दसभुज अति सोहे ।
त्रिगुण रूप निरखते त्रिभुवन जन मोहे ॥
ॐ जय शिव ओंकारा

अक्षमाला वनमाला मुण्डमाला धारी ।
त्रिपुरारी कंसारी कर माला धारी ॥
ॐ जय शिव ओंकारा

ॐ जय शिव ओंकारा
सुखकारी दुखहारी जगपालन कारी ॥
कर के मध्य कमंडलु चक्र त्रिशूलधारी ।

ॐ जय शिव ओंकारा
सनकादिक गरुणादिक भूतादिक संगे ॥
श्वेतांबर पीतांबर बाघंबर अंगे ।

ब्रह्मा विष्णु सदाशिव जानत अविवेका ।
प्रणवाक्षर में शोभित ये तीनों एका ॥
ॐ जय शिव ओंकारा

लक्ष्मी व सावित्री पार्वती संगा ।
पार्वती अर्द्धांगी, शिवलहरी गंगा ॥
ॐ जय शिव ओंकारा

त्रिगुणस्वामी जी की आरती जो कोइ नर गावे ।
कहत शिवानंद स्वामी सुख संपति पावे ॥
ॐ जय शिव ओंकारा। 
</pre>`;
var laxmiAarti=`<h3 class="arti-text-div">लक्ष्मी  जी की आरती</h3>
<pre class="theme" id="preTag">
मां लक्ष्‍मी की आरती
मां लक्ष्‍मी की आरती
ॐ जय लक्ष्मी माता,
मैया जय लक्ष्मी माता ।
तुमको निसदिन सेवत,
हर विष्णु विधाता ॥
उमा, रमा, ब्रम्हाणी,
तुम ही जग माता ।
सूर्य चद्रंमा ध्यावत,
नारद ऋषि गाता ॥
॥ॐ जय लक्ष्मी माता...॥

दुर्गा रूप निरंजनि,
सुख-संपत्ति दाता ।
जो कोई तुमको ध्याता,
ऋद्धि-सिद्धि धन पाता ॥
॥ॐ जय लक्ष्मी माता...॥

तुम ही पाताल निवासनी,
तुम ही शुभदाता ।
कर्म-प्रभाव-प्रकाशनी,
भव निधि की त्राता ॥
॥ॐ जय लक्ष्मी माता...॥

जिस घर तुम रहती हो,
ताँहि में हैं सद्‍गुण आता ।
सब सभंव हो जाता,
मन नहीं घबराता ॥
।।ॐ जय लक्ष्मी माता...॥

तुम बिन यज्ञ ना होता,
वस्त्र न कोई पाता ।
खान पान का वैभव,
सब तुमसे आता ॥
ॐ जय लक्ष्मी माता...॥

शुभ गुण मंदिर सुंदर,
क्षीरोदधि जाता ।
रत्न चतुर्दश तुम बिन,
कोई नहीं पाता ॥
।।ॐ जय लक्ष्मी माता...॥

महालक्ष्मी जी की आरती,
जो कोई नर गाता ।
उँर आंनद समाता,
पाप उतर जाता ॥
॥ॐ जय लक्ष्मी माता...॥
</pre>`;
var durgaAarti=`<h3 class="arti-text-div">मां दुर्गा जी की आरती</h3>
<pre class="theme" id="preTag">
जय अम्बे गौरी, मैया जय श्यामा गौरी।

तुमको निशदिन ध्यावत, हरि ब्रह्मा शिव री।। जय अम्बे गौरी,...।

मांग सिंदूर बिराजत, टीको मृगमद को।

उज्ज्वल से दोउ नैना, चंद्रबदन नीको।। जय अम्बे गौरी,...।

कनक समान कलेवर, रक्ताम्बर राजै।

रक्तपुष्प गल माला, कंठन पर साजै।। जय अम्बे गौरी,...।

केहरि वाहन राजत, खड्ग खप्परधारी।

सुर-नर मुनिजन सेवत, तिनके दुःखहारी।। जय अम्बे गौरी,...।

कानन कुण्डल शोभित, नासाग्रे मोती।

कोटिक चंद्र दिवाकर, राजत समज्योति।। जय अम्बे गौरी,...।

शुम्भ निशुम्भ बिडारे, महिषासुर घाती।

धूम्र विलोचन नैना, निशिदिन मदमाती।। जय अम्बे गौरी,...।

चण्ड-मुण्ड संहारे, शौणित बीज हरे।

मधु कैटभ दोउ मारे, सुर भयहीन करे।। जय अम्बे गौरी,...।

ब्रह्माणी, रुद्राणी, तुम कमला रानी।

आगम निगम बखानी, तुम शिव पटरानी।। जय अम्बे गौरी,...।

चौंसठ योगिनि मंगल गावैं, नृत्य करत भैरू।

बाजत ताल मृदंगा, अरू बाजत डमरू।। जय अम्बे गौरी,...।

तुम ही जग की माता, तुम ही हो भरता।

भक्तन की दुःख हरता, सुख सम्पत्ति करता।। जय अम्बे गौरी,...।

भुजा चार अति शोभित, खड्ग खप्परधारी।

मनवांछित फल पावत, सेवत नर नारी।। जय अम्बे गौरी,...।

कंचन थाल विराजत, अगर कपूर बाती।

श्री मालकेतु में राजत, कोटि रतन ज्योति।। जय अम्बे गौरी,...।

अम्बेजी की आरती जो कोई नर गावै।

कहत शिवानंद स्वामी, सुख-सम्पत्ति पावै।। जय अम्बे गौरी,...।

</pre>`;
var sarsavatiAarti=`<h3 class="arti-text-div"> सरस्वती जी की आरती</h3>
<pre class="theme" id="preTag" >
जय सरस्वती माता,
मैया जय सरस्वती माता ।
सदगुण वैभव शालिनी,
त्रिभुवन विख्याता ॥
जय जय सरस्वती माता...॥
चन्द्रवदनि पद्मासिनि,
द्युति मंगलकारी ।
सोहे शुभ हंस सवारी,
अतुल तेजधारी ॥
जय जय सरस्वती माता...॥

बाएं कर में वीणा,
दाएं कर माला ।
शीश मुकुट मणि सोहे,
गल मोतियन माला ॥
जय जय सरस्वती माता...॥

देवी शरण जो आए,
उनका उद्धार किया ।
पैठी मंथरा दासी,
रावण संहार किया ॥
जय जय सरस्वती माता...॥

विद्या ज्ञान प्रदायिनि,
ज्ञान प्रकाश भरो ।
मोह अज्ञान और तिमिर का,
जग से नाश करो ॥
जय जय सरस्वती माता...॥

धूप दीप फल मेवा,
माँ स्वीकार करो ।
ज्ञानचक्षु दे माता,
जग निस्तार करो ॥
॥ जय सरस्वती माता...॥

माँ सरस्वती की आरती,
जो कोई जन गावे ।
हितकारी सुखकारी,
ज्ञान भक्ति पावे ॥
जय जय सरस्वती माता...॥

जय सरस्वती माता,
जय जय सरस्वती माता ।
सदगुण वैभव शालिनी,
त्रिभुवन विख्याता ॥
</pre>`;



// chalisha
var ShivChalisha=`<h3 class="arti-text-div">चालीसा </h3>
<pre class="theme" id="preTag" >
श्री शिव चालीसा - 1
||दोहा||
जय गणेश गिरिजा सुवन, मंगल मूल सुजान।
कहत अयोध्यादास तुम, देहु अभय वरदान ॥

||चौपाई||

जय गिरिजा पति दीन दयाला ।
सदा करत सन्तन प्रतिपाला ॥

भाल चन्द्रमा सोहत नीके ।
कानन कुण्डल नागफनी के ॥

अंग गौर शिर गंग बहाये ।
मुण्डमाल तन क्षार लगाए ॥

वस्त्र खाल बाघम्बर सोहे ।
छवि को देखि नाग मन मोहे ॥

मैना मातु की हवे दुलारी ।
बाम अंग सोहत छवि न्यारी ॥

कर त्रिशूल सोहत छवि भारी ।
करत सदा शत्रुन क्षयकारी ॥

नन्दि गणेश सोहै तहँ कैसे ।
सागर मध्य कमल हैं जैसे ॥

कार्तिक श्याम और गणराऊ ।
या छवि को कहि जात न काऊ ॥

देवन जबहीं जाय पुकारा ।
तब ही दुख प्रभु आप निवारा ॥

किया उपद्रव तारक भारी ।
देवन सब मिलि तुमहिं जुहारी ॥

तुरत षडानन आप पठायउ ।
लवनिमेष महँ मारि गिरायउ ॥

आप जलंधर असुर संहारा ।
सुयश तुम्हार विदित संसारा ॥


त्रिपुरासुर सन युद्ध मचाई ।
सबहिं कृपा कर लीन बचाई ॥

किया तपहिं भागीरथ भारी ।
पुरब प्रतिज्ञा तासु पुरारी ॥

दानिन महँ तुम सम कोउ नाहीं ।
सेवक स्तुति करत सदाहीं ॥

वेद नाम महिमा तव गाई।
अकथ अनादि भेद नहिं पाई ॥

प्रकटी उदधि मंथन में ज्वाला ।
जरत सुरासुर भए विहाला ॥

कीन्ही दया तहं करी सहाई ।
नीलकण्ठ तब नाम कहाई ॥

पूजन रामचन्द्र जब कीन्हा ।
जीत के लंक विभीषण दीन्हा ॥

सहस कमल में हो रहे धारी ।
कीन्ह परीक्षा तबहिं पुरारी ॥

एक कमल प्रभु राखेउ जोई ।
कमल नयन पूजन चहं सोई ॥

कठिन भक्ति देखी प्रभु शंकर ।
भए प्रसन्न दिए इच्छित वर ॥

जय जय जय अनन्त अविनाशी ।
करत कृपा सब के घटवासी ॥

दुष्ट सकल नित मोहि सतावै ।
भ्रमत रहौं मोहि चैन न आवै ॥

त्राहि त्राहि मैं नाथ पुकारो ।
येहि अवसर मोहि आन उबारो ॥

लै त्रिशूल शत्रुन को मारो ।
संकट से मोहि आन उबारो ॥

मात-पिता भ्राता सब होई ।
संकट में पूछत नहिं कोई ॥

स्वामी एक है आस तुम्हारी ।
आय हरहु मम संकट भारी ॥

धन निर्धन को देत सदा हीं ।
जो कोई जांचे सो फल पाहीं ॥

अस्तुति केहि विधि करैं तुम्हारी ।
क्षमहु नाथ अब चूक हमारी ॥

शंकर हो संकट के नाशन ।
मंगल कारण विघ्न विनाशन ॥

योगी यति मुनि ध्यान लगावैं ।
शारद नारद शीश नवावैं ॥

नमो नमो जय नमः शिवाय ।
सुर ब्रह्मादिक पार न पाय ॥

जो यह पाठ करे मन लाई ।
ता पर होत है शम्भु सहाई ॥

ॠनियां जो कोई हो अधिकारी ।
पाठ करे सो पावन हारी ॥

पुत्र हीन कर इच्छा जोई ।
निश्चय शिव प्रसाद तेहि होई ॥

पण्डित त्रयोदशी को लावे ।
ध्यान पूर्वक होम करावे ॥

त्रयोदशी व्रत करै हमेशा ।
ताके तन नहीं रहै कलेशा ॥

धूप दीप नैवेद्य चढ़ावे ।
शंकर सम्मुख पाठ सुनावे ॥

जन्म जन्म के पाप नसावे ।
अन्त धाम शिवपुर में पावे ॥

कहैं अयोध्यादास आस तुम्हारी ।
जानि सकल दुःख हरहु हमारी ॥

||दोहा||

नित्त नेम कर प्रातः ही,पाठ करौं चालीसा ।
तुम मेरी मनोकामना,पूर्ण करो जगदीश ॥

मगसर छठि हेमन्त ॠतु,संवत चौसठ जान ।
अस्तुति चालीसा शिवहि,पूर्ण कीन कल्याण ॥



श्री शिव चालीसा - 2

अज अनादि अविगत अलख, अकल अतुल अविकार।
बंदौं शिव-पद-युग-कमल अमल अतीव उदार॥

आर्तिहरण सुखकरण शुभ भक्ति -मुक्ति -दातार।
करौ अनुग्रह दीन लखि अपनो विरद विचार॥

पर्यो पतित भवकूप महँ सहज नरक आगार।
सहज सुहृद पावन-पतित, सहजहि लेहु उबार॥

पलक-पलक आशा भर्यो, रह्यो सुबाट निहार।
ढरौ तुरन्त स्वभाववश, नेक न करौ अबार॥

जय शिव शङ्कर औढरदानी।
जय गिरितनया मातु भवानी॥

सर्वोत्तम योगी योगेश्वर।
सर्वलोक-ईश्वर-परमेश्वर॥

सब उर प्रेरक सर्वनियन्ता।
उपद्रष्टा भर्ता अनुमन्ता॥

पराशक्ति – पति अखिल विश्वपति।
परब्रह्म परधाम परमगति॥

सर्वातीत अनन्य सर्वगत।
निजस्वरूप महिमामें स्थितरत॥

अंगभूति – भूषित श्मशानचर।
भुजंगभूषण चन्द्रमुकुटधर॥


वृषवाहन नंदीगणनायक।
अखिल विश्व के भाग्य-विधायक॥

व्याघ्रचर्म परिधान मनोहर।
रीछचर्म ओढे गिरिजावर॥

कर त्रिशूल डमरूवर राजत।
अभय वरद मुद्रा शुभ साजत॥

तनु कर्पूर-गोर उज्ज्वलतम।
पिंगल जटाजूट सिर उत्तम॥

भाल त्रिपुण्ड्र मुण्डमालाधर।
गल रुद्राक्ष-माल शोभाकर॥

विधि-हरि-रुद्र त्रिविध वपुधारी।
बने सृजन-पालन-लयकारी॥

तुम हो नित्य दया के सागर।
आशुतोष आनन्द-उजागर॥

अति दयालु भोले भण्डारी।
अग-जग सबके मंगलकारी॥

सती-पार्वती के प्राणेश्वर।
स्कन्द-गणेश-जनक शिव सुखकर॥

हरि-हर एक रूप गुणशीला।
करत स्वामि-सेवक की लीला॥

रहते दोउ पूजत पुजवावत।
पूजा-पद्धति सबन्हि सिखावत॥

मारुति बन हरि-सेवा कीन्ही।
रामेश्वर बन सेवा लीन्ही॥

जग-जित घोर हलाहल पीकर।
बने सदाशिव नीलकंठ वर॥

असुरासुर शुचि वरद शुभंकर।
असुरनिहन्ता प्रभु प्रलयंकर॥

नम: शिवाय मन्त्र जपत मिटत सब क्लेश भयंकर॥

जो नर-नारि रटत शिव-शिव नित।
तिनको शिव अति करत परमहित॥

श्रीकृष्ण तप कीन्हों भारी।
ह्वै प्रसन्न वर दियो पुरारी॥

अर्जुन संग लडे किरात बन।
दियो पाशुपत-अस्त्र मुदित मन॥

भक्तन के सब कष्ट निवारे।
दे निज भक्ति सबन्हि उद्धारे॥

शङ्खचूड जालन्धर मारे।
दैत्य असंख्य प्राण हर तारे॥

अन्धकको गणपति पद दीन्हों।
शुक्र शुक्रपथ बाहर कीन्हों॥

तेहि सजीवनि विद्या दीन्हीं।
बाणासुर गणपति-गति कीन्हीं॥

अष्टमूर्ति पंचानन चिन्मय।
द्वादश ज्योतिर्लिङ्ग ज्योतिर्मय॥

भुवन चतुर्दश व्यापक रूपा।
अकथ अचिन्त्य असीम अनूपा॥

काशी मरत जंतु अवलोकी।
देत मुक्ति -पद करत अशोकी॥

भक्त भगीरथ की रुचि राखी।
जटा बसी गंगा सुर साखी॥

रुरु अगस्त्य उपमन्यू ज्ञानी।
ऋषि दधीचि आदिक विज्ञानी॥

शिवरहस्य शिवज्ञान प्रचारक।
शिवहिं परम प्रिय लोकोद्धारक॥

इनके शुभ सुमिरनतें शंकर।
देत मुदित ह्वै अति दुर्लभ वर॥

अति उदार करुणावरुणालय।
हरण दैन्य-दारिद्रय-दु:ख-भय॥

तुम्हरो भजन परम हितकारी।
विप्र शूद्र सब ही अधिकारी॥

बालक वृद्ध नारि-नर ध्यावहिं।
ते अलभ्य शिवपद को पावहिं॥

भेदशून्य तुम सबके स्वामी।
सहज सुहृद सेवक अनुगामी॥

जो जन शरण तुम्हारी आवत।
सकल दुरित तत्काल नशावत॥

|| दोहा ||

बहन करौ तुम शीलवश, निज जनकौ सब भार।
गनौ न अघ, अघ-जाति कछु, सब विधि करो सँभार

तुम्हरो शील स्वभाव लखि, जो न शरण तव होय।
तेहि सम कुटिल कुबुद्धि जन, नहिं कुभाग्य जन कोय

दीन-हीन अति मलिन मति, मैं अघ-ओघ अपार।
कृपा-अनल प्रगटौ तुरत, करो पाप सब छार॥

कृपा सुधा बरसाय पुनि, शीतल करो पवित्र।
राखो पदकमलनि सदा, हे कुपात्र के मित्र॥

।। इति श्री शिव चालीसा समाप्त ।।
</pre>`;

var GaneshChalisha=`<h3 class="arti-text-div">चालीसा </h3>
<pre class="theme" id="preTag" >
जय गणपति सद्गुण सदन कविवर बदन कृपाल।

विघ्न हरण मंगल करण जय जय गिरिजालाल॥

जय जय जय गणपति राजू। मंगल भरण करण शुभ काजू॥

जय गजबदन सदन सुखदाता। विश्व विनायक बुद्धि विधाता॥

वक्र तुण्ड शुचि शुण्ड सुहावन। तिलक त्रिपुण्ड भाल मन भावन॥

राजित मणि मुक्तन उर माला। स्वर्ण मुकुट शिर नयन विशाला॥

पुस्तक पाणि कुठार त्रिशूलं। मोदक भोग सुगन्धित फूलं॥

सुन्दर पीताम्बर तन साजित। चरण पादुका मुनि मन राजित॥

धनि शिवसुवन षडानन भ्राता। गौरी ललन विश्व-विधाता॥

ऋद्धि सिद्धि तव चँवर डुलावे। मूषक वाहन सोहत द्वारे॥

कहौ जन्म शुभ कथा तुम्हारी। अति शुचि पावन मंगल कारी॥

एक समय गिरिराज कुमारी। पुत्र हेतु तप कीन्हा भारी॥

भयो यज्ञ जब पूर्ण अनूपा। तब पहुंच्यो तुम धरि द्विज रूपा।

अतिथि जानि कै गौरी सुखारी। बहु विधि सेवा करी तुम्हारी॥

अति प्रसन्न ह्वै तुम वर दीन्हा। मातु पुत्र हित जो तप कीन्हा॥

मिलहि पुत्र तुहि बुद्धि विशाला। बिना गर्भ धारण यहि काला॥

गणनायक गुण ज्ञान निधाना। पूजित प्रथम रूप भगवाना॥

अस कहि अन्तर्धान रूप ह्वै। पलना पर बालक स्वरूप ह्वै॥

बनि शिशु रुदन जबहि तुम ठाना। लखि मुख सुख नहिं गौरि समाना॥

सकल मगन सुख मंगल गावहिं। नभ ते सुरन सुमन वर्षावहिं॥

शम्भु उमा बहुदान लुटावहिं। सुर मुनि जन सुत देखन आवहिं॥

लखि अति आनन्द मंगल साजा। देखन भी आए शनि राजा॥

निज अवगुण गुनि शनि मन माहीं। बालक देखन चाहत नाहीं॥

गिरजा कछु मन भेद बढ़ायो। उत्सव मोर न शनि तुहि भायो॥

कहन लगे शनि मन सकुचाई। का करिहौ शिशु मोहि दिखाई॥

नहिं विश्वास उमा कर भयऊ। शनि सों बालक देखन कह्यऊ॥

पड़तहिं शनि दृग कोण प्रकाशा। बालक शिर उड़ि गयो आकाशा॥

गिरजा गिरीं विकल ह्वै धरणी। सो दुख दशा गयो नहिं वरणी॥

हाहाकार मच्यो कैलाशा। शनि कीन्ह्यों लखि सुत को नाशा॥

तुरत गरुड़ चढ़ि विष्णु सिधाए। काटि चक्र सो गज शिर लाए॥

बालक के धड़ ऊपर धारयो। प्राण मन्त्र पढ़ शंकर डारयो॥

नाम गणेश शम्भु तब कीन्हे। प्रथम पूज्य बुद्धि निधि वर दीन्हे॥

बुद्धि परीक्षा जब शिव कीन्हा। पृथ्वी की प्रदक्षिणा लीन्हा॥

चले षडानन भरमि भुलाई। रची बैठ तुम बुद्धि उपाई॥

चरण मातु-पितु के धर लीन्हें। तिनके सात प्रदक्षिण कीन्हें॥

धनि गणेश कहि शिव हिय हरषे। नभ ते सुरन सुमन बहु बरसे॥

तुम्हरी महिमा बुद्धि बड़ाई। शेष सहस मुख सकै न गाई॥

मैं मति हीन मलीन दुखारी। करहुँ कौन बिधि विनय तुम्हारी॥

भजत रामसुन्दर प्रभुदासा। लख प्रयाग ककरा दुर्वासा॥

अब प्रभु दया दीन पर कीजै। अपनी शक्ति भक्ति कुछ दीजै॥


दोहा


श्री गणेश यह चालीसा पाठ करें धर ध्यान।

नित नव मंगल गृह बसै लहे जगत सन्मान॥

सम्वत् अपन सहस्र दश ऋषि पंचमी दिनेश।

पूरण चालीसा भयो मंगल मूर्ति गणेश॥
</pre>`;

var hanumanChalisha=`<h3 class="arti-text-div">चालीसा </h3>
<pre class="theme" id="preTag" >
                दोहा :

    श्रीगुरु चरन सरोज रज, निज मनु मुकुरु सुधारि।
    बरनऊं रघुबर बिमल जसु, जो दायकु फल चारि।। 
    बुद्धिहीन तनु जानिके, सुमिरौं पवन-कुमार।
    बल बुद्धि बिद्या देहु मोहिं, हरहु कलेस बिकार।। 
 
                चौपाई :
        
        जय हनुमान ज्ञान गुन सागर।
        जय कपीस तिहुं लोक उजागर।।
        
        रामदूत अतुलित बल धामा।
        अंजनि-पुत्र पवनसुत नामा।।
        
        महाबीर बिक्रम बजरंगी।
        कुमति निवार सुमति के संगी।।
        
        कंचन बरन बिराज सुबेसा।
        कानन कुंडल कुंचित केसा।।
        
        हाथ बज्र औ ध्वजा बिराजै।
        कांधे मूंज जनेऊ साजै।
        
        संकर सुवन केसरीनंदन।
        तेज प्रताप महा जग बन्दन।।
        
        विद्यावान गुनी अति चातुर।
        राम काज करिबे को आतुर।।
        
        प्रभु चरित्र सुनिबे को रसिया।
        राम लखन सीता मन बसिया।।
        
        सूक्ष्म रूप धरि सियहिं दिखावा।
        बिकट रूप धरि लंक जरावा।।
        
        भीम रूप धरि असुर संहारे।
        रामचंद्र के काज संवारे।।
        
        लाय सजीवन लखन जियाये।
        श्रीरघुबीर हरषि उर लाये।।
        
        रघुपति कीन्ही बहुत बड़ाई।
        तुम मम प्रिय भरतहि सम भाई।।
        
        सहस बदन तुम्हरो जस गावैं।
        अस कहि श्रीपति कंठ लगावैं।।
        
        सनकादिक ब्रह्मादि मुनीसा।
        नारद सारद सहित अहीसा।।
        
        जम कुबेर दिगपाल जहां ते।
        कबि कोबिद कहि सके कहां ते।।
        
        तुम उपकार सुग्रीवहिं कीन्हा।
        राम मिलाय राज पद दीन्हा।।
        
        तुम्हरो मंत्र बिभीषन माना।
        लंकेस्वर भए सब जग जाना।।
        
        जुग सहस्र जोजन पर भानू।
        लील्यो ताहि मधुर फल जानू।।
        
        प्रभु मुद्रिका मेलि मुख माहीं।
        जलधि लांघि गये अचरज नाहीं।।
        
        दुर्गम काज जगत के जेते।
        सुगम अनुग्रह तुम्हरे तेते।।
        
        राम दुआरे तुम रखवारे।
        होत न आज्ञा बिनु पैसारे।।
        
        सब सुख लहै तुम्हारी सरना।
        तुम रक्षक काहू को डर ना।।
        
        आपन तेज सम्हारो आपै।
        तीनों लोक हांक तें कांपै।।
        
        भूत पिसाच निकट नहिं आवै।
        महाबीर जब नाम सुनावै।।
        
        नासै रोग हरै सब पीरा।
        जपत निरंतर हनुमत बीरा।।
        
        संकट तें हनुमान छुड़ावै।
        मन क्रम बचन ध्यान जो लावै।।
        
        सब पर राम तपस्वी राजा।
        तिन के काज सकल तुम साजा।
        
        और मनोरथ जो कोई लावै।
        सोइ अमित जीवन फल पावै।।
        
        चारों जुग परताप तुम्हारा।
        है परसिद्ध जगत उजियारा।।
        
        साधु-संत के तुम रखवारे।
        असुर निकंदन राम दुलारे।।
        
        अष्ट सिद्धि नौ निधि के दाता।
        अस बर दीन जानकी माता।।
        
        राम रसायन तुम्हरे पासा।
        सदा रहो रघुपति के दासा।।
        
        तुम्हरे भजन राम को पावै।
        जनम-जनम के दुख बिसरावै।।
        
        अन्तकाल रघुबर पुर जाई।
        जहां जन्म हरि-भक्त कहाई।।
        
        और देवता चित्त न धरई।
        हनुमत सेइ सर्ब सुख करई।।
        
        संकट कटै मिटै सब पीरा।
        जो सुमिरै हनुमत बलबीरा।।
        
        जै जै जै हनुमान गोसाईं।
        कृपा करहु गुरुदेव की नाईं।।
        
        जो सत बार पाठ कर कोई।
        छूटहि बंदि महा सुख होई।।
        
        जो यह पढ़ै हनुमान चालीसा।
        होय सिद्धि साखी गौरीसा।।
        
        तुलसीदास सदा हरि चेरा।
        कीजै नाथ हृदय मंह डेरा।। 
 
            दोहा :
 
पवन तनय संकट हरन, मंगल मूरति रूप।
राम लखन सीता सहित, हृदय बसहु सुर भूप।।
</pre>`;

var DuragaChalisha=`<h3 class="arti-text-div"> </h3>
<pre class="theme" id="preTag" >
        दुर्गा चालीसा
    
    नमो नमो दुर्गे सुख करनी।
    नमो नमो दुर्गे दुःख हरनी॥
    
    निरंकार है ज्योति तुम्हारी।
    तिहूं लोक फैली उजियारी॥
    
    शशि ललाट मुख महाविशाला।
    नेत्र लाल भृकुटि विकराला॥
    
    रूप मातु को अधिक सुहावे।
    दरश करत जन अति सुख पावे॥
    
    तुम संसार शक्ति लै कीना।
    पालन हेतु अन्न धन दीना॥
    
    अन्नपूर्णा हुई जग पाला।
    तुम ही आदि सुन्दरी बाला॥
    
    प्रलयकाल सब नाशन हारी।
    तुम गौरी शिवशंकर प्यारी॥
    
    शिव योगी तुम्हरे गुण गावें।
    ब्रह्मा विष्णु तुम्हें नित ध्यावें॥
    
    रूप सरस्वती को तुम धारा।
    दे सुबुद्धि ऋषि मुनिन उबारा॥
    
    धरयो रूप नरसिंह को अम्बा।
    परगट भई फाड़कर खम्बा॥
    
    रक्षा करि प्रह्लाद बचायो।
    हिरण्याक्ष को स्वर्ग पठायो॥
    
    लक्ष्मी रूप धरो जग माहीं।
    श्री नारायण अंग समाहीं॥
    
    क्षीरसिन्धु में करत विलासा।
    दयासिन्धु दीजै मन आसा॥
    
    हिंगलाज में तुम्हीं भवानी।
    महिमा अमित न जात बखानी॥
    
    मातंगी अरु धूमावति माता।
    भुवनेश्वरी बगला सुख दाता॥
    
    श्री भैरव तारा जग तारिणी।
    छिन्न भाल भव दुःख निवारिणी॥
    
    केहरि वाहन सोह भवानी।
    लांगुर वीर चलत अगवानी॥
    
    कर में खप्पर खड्ग विराजै।
    जाको देख काल डर भाजै॥
    
    सोहै अस्त्र और त्रिशूला।
    जाते उठत शत्रु हिय शूला॥
    
    नगरकोट में तुम्हीं विराजत।
    तिहुंलोक में डंका बाजत॥
    
    शुंभ निशुंभ दानव तुम मारे।
    रक्तबीज शंखन संहारे॥
    
    महिषासुर नृप अति अभिमानी।
    जेहि अघ भार मही अकुलानी॥
    
    रूप कराल कालिका धारा।
    सेन सहित तुम तिहि संहारा॥
    
    परी गाढ़ संतन पर जब जब।
    भई सहाय मातु तुम तब तब॥
    
    अमरपुरी अरु बासव लोका।
    तब महिमा सब रहें अशोका॥
    
    ज्वाला में है ज्योति तुम्हारी।
    तुम्हें सदा पूजें नर-नारी॥
    
    प्रेम भक्ति से जो यश गावें।
    दुःख दारिद्र निकट नहिं आवें॥
    
    ध्यावे तुम्हें जो नर मन लाई।
    जन्म-मरण ताकौ छुटि जाई॥
    
    जोगी सुर मुनि कहत पुकारी।
    योग न हो बिन शक्ति तुम्हारी॥
    
    शंकर आचारज तप कीनो।
    काम अरु क्रोध जीति सब लीनो॥
    
    निशिदिन ध्यान धरो शंकर को।
    काहु काल नहिं सुमिरो तुमको॥
    
    शक्ति रूप का मरम न पायो।
    शक्ति गई तब मन पछितायो॥
    
    शरणागत हुई कीर्ति बखानी।
    जय जय जय जगदम्ब भवानी॥
    
    भई प्रसन्न आदि जगदम्बा।
    दई शक्ति नहिं कीन विलम्बा॥
    
    मोको मातु कष्ट अति घेरो।
    तुम बिन कौन हरै दुःख मेरो॥
    
    आशा तृष्णा निपट सतावें।
    रिपू मुरख मौही डरपावे॥
    
    शत्रु नाश कीजै महारानी।
    सुमिरौं इकचित तुम्हें भवानी॥
    
    करो कृपा हे मातु दयाला।
    ऋद्धि-सिद्धि दै करहु निहाला।
    
    जब लगि जिऊं दया फल पाऊं ।
    तुम्हरो यश मैं सदा सुनाऊं ॥
    
    दुर्गा चालीसा जो कोई गावै।
    सब सुख भोग परमपद पावै॥
    
    देवीदास शरण निज जानी।
    करहु कृपा जगदम्ब भवानी॥
    
    ॥ इति श्री दुर्गा चालीसा सम्पूर्ण ॥
</pre>`;

var sarsawatiChalisha=`<h3 class="arti-text-div"> </h3>
<pre class="theme" id="preTag" >
        ॥ दोहा ॥
    जनक जननि पद कमल रज,निज मस्तक पर धारि।
    बन्दौं मातु सरस्वती, बुद्धि बल दे दातारि॥
    पूर्ण जगत में व्याप्त तव, महिमा अमित अनंतु।
    रामसागर के पाप को, मातु तुही अब हन्तु॥

        ॥ चौपाई ॥

    जय श्री सकल बुद्धि बलरासी।
    जय सर्वज्ञ अमर अविनासी॥

    जय जय जय वीणाकर धारी।
    करती सदा सुहंस सवारी॥

    रूप चतुर्भुजधारी माता।
    सकल विश्व अन्दर विख्याता॥

    जग में पाप बुद्धि जब होती।
    जबहि धर्म की फीकी ज्योती॥

    तबहि मातु ले निज अवतारा।
    पाप हीन करती महि तारा॥

    बाल्मीकि जी थे बहम ज्ञानी।
    तव प्रसाद जानै संसारा॥

    रामायण जो रचे बनाई।
    आदि कवी की पदवी पाई॥

    कालिदास जो भये विख्याता।
    तेरी कृपा दृष्टि से माता॥

    तुलसी सूर आदि विद्धाना।
    भये और जो ज्ञानी नाना॥

    तिन्हहिं न और रहेउ अवलम्बा।
    केवल कृपा आपकी अम्बा॥

    करहु कृपा सोइ मातु भवानी।
    दुखित दीन निज दासहि जानी॥

    पुत्र करै अपराध बहूता।
    तेहि न धरइ चित सुन्दर माता॥

    राखु लाज जननी अब मेरी।
    विनय करूं बहु भांति घनेरी॥

    मैं अनाथ तेरी अवलंबा।
    कृपा करउ जय जय जगदंबा॥

    मधु कैटभ जो अति बलवाना।
    बाहुयुद्ध विष्णू ते ठाना॥

    समर हजार पांच में घोरा।
    फिर भी मुख उनसे नहिं मोरा॥

    मातु सहाय भई तेहि काला।
    बुद्धि विपरीत करी खलहाला॥

    तेहि ते मृत्यु भई खल केरी।
    पुरवहु मातु मनोरथ मेरी॥

    चंड मुण्ड जो थे विख्याता।
    छण महुं संहारेउ तेहि माता॥

    रक्तबीज से समरथ पापी।
    सुर-मुनि हृदय धरा सब कांपी॥

    काटेउ सिर जिम कदली खम्बा।
    बार बार बिनवउं जगदंबा॥

    जग प्रसिद्ध जो शुंभ निशुंभा।
    छिन में बधे ताहि तू अम्बा॥

    भरत-मातु बुधि फेरेउ जाई।
    रामचन्द्र बनवास कराई॥

    एहि विधि रावन वध तुम कीन्हा।
    सुर नर मुनि सब कहुं सुख दीन्हा॥

    को समरथ तव यश गुन गाना।
    निगम अनादि अनंत बखाना॥

    विष्णु रूद्र अज सकहिं न मारी।
    जिनकी हो तुम रक्षाकारी॥

    रक्त दन्तिका और शताक्षी।
    नाम अपार है दानव भक्षी॥

    दुर्गम काज धरा पर कीन्हा।
    दुर्गा नाम सकल जग लीन्हा॥

    दुर्ग आदि हरनी तू माता।
    कृपा करहु जब जब सुखदाता॥

    नृप कोपित जो मारन चाहै।
    कानन में घेरे मृग नाहै॥

    सागर मध्य पोत के भंगे।
    अति तूफान नहिं कोऊ संगे॥

    भूत प्रेत बाधा या दुःख में।
    हो दरिद्र अथवा संकट में॥

    नाम जपे मंगल सब होई।
    संशय इसमें करइ न कोई॥

    पुत्रहीन जो आतुर भाई।
    सबै छांड़ि पूजें एहि माई॥

    करै पाठ नित यह चालीसा।
    होय पुत्र सुन्दर गुण ईसा॥

    धूपादिक नैवेद्य चढावै।
    संकट रहित अवश्य हो जावै॥

    भक्ति मातु की करै हमेशा।
    निकट न आवै ताहि कलेशा॥

    बंदी पाठ करें शत बारा।
    बंदी पाश दूर हो सारा॥

    करहु कृपा भवमुक्ति भवानी।
    मो कहं दास सदा निज जानी॥

        ॥ दोहा ॥

माता सूरज कान्ति तव,अंधकार मम रूप।
डूबन ते रक्षा करहु,परूं न मैं भव-कूप॥
बल बुद्धि विद्या देहुं मोहि,सुनहु सरस्वति मातु।
अधम रामसागरहिं तुम,आश्रय देउ पुनातु॥
</pre>`;

var laxmiChalisha=`<h3 class="arti-text-div"> </h3>
<pre class="theme" id="preTag" >
दोहा
 
मातु लक्ष्मी करि कृपा करो हृदय में वास।
मनोकामना सिद्ध कर पुरवहु मेरी आस॥
 
सिंधु सुता विष्णुप्रिये नत शिर बारंबार।
ऋद्धि सिद्धि मंगलप्रदे नत शिर बारंबार॥ टेक॥
 
 
सोरठा
 
यही मोर अरदास, हाथ जोड़ विनती करूं।
सब विधि करौ सुवास, जय जननि जगदंबिका॥
 
॥ चौपाई ॥
 
सिन्धु सुता मैं सुमिरौं तोही।
 ज्ञान बुद्धि विद्या दो मोहि॥
तुम समान नहिं कोई उपकारी।
 सब विधि पुरबहु आस हमारी॥
जै जै जगत जननि जगदम्बा।
 सबके तुमही हो स्वलम्बा॥
तुम ही हो घट घट के वासी।
 विनती यही हमारी खासी॥
जग जननी जय सिन्धु कुमारी।
 दीनन की तुम हो हितकारी॥
विनवौं नित्य तुमहिं महारानी।
 कृपा करौ जग जननि भवानी।
केहि विधि स्तुति करौं तिहारी।
 सुधि लीजै अपराध बिसारी॥
कृपा दृष्टि चितवो मम ओरी।
 जगत जननि विनती सुन मोरी॥
ज्ञान बुद्धि जय सुख की दाता।
 संकट हरो हमारी माता॥
क्षीर सिंधु जब विष्णु मथायो।
 चौदह रत्न सिंधु में पायो॥
चौदह रत्न में तुम सुखरासी।
 सेवा कियो प्रभुहिं बनि दासी॥
जब जब जन्म जहां प्रभु लीन्हा।
रूप बदल तहं सेवा कीन्हा॥
स्वयं विष्णु जब नर तनु धारा।
लीन्हेउ अवधपुरी अवतारा॥
तब तुम प्रकट जनकपुर माहीं।
सेवा कियो हृदय पुलकाहीं॥
अपनायो तोहि अन्तर्यामी।
विश्व विदित त्रिभुवन की स्वामी॥
तुम सब प्रबल शक्ति नहिं आनी।
कहं तक महिमा कहौं बखानी॥
मन क्रम वचन करै सेवकाई।
मन- इच्छित वांछित फल पाई॥
तजि छल कपट और चतुराई।
पूजहिं विविध भांति मन लाई॥
और हाल मैं कहौं बुझाई।
जो यह पाठ करे मन लाई॥
ताको कोई कष्ट न होई।
मन इच्छित फल पावै फल सोई॥
त्राहि- त्राहि जय दुःख निवारिणी।
त्रिविध ताप भव बंधन हारिणि॥
जो यह चालीसा पढ़े और पढ़ावे।
इसे ध्यान लगाकर सुने सुनावै॥
ताको कोई न रोग सतावै।
पुत्र आदि धन सम्पत्ति पावै।
पुत्र हीन और सम्पत्ति हीना।
अन्धा बधिर कोढ़ी अति दीना॥
विप्र बोलाय कै पाठ करावै।
शंका दिल में कभी न लावै॥
पाठ करावै दिन चालीसा।
ता पर कृपा करैं गौरीसा॥
सुख सम्पत्ति बहुत सी पावै।
कमी नहीं काहू की आवै॥
बारह मास करै जो पूजा।
तेहि सम धन्य और नहिं दूजा॥
प्रतिदिन पाठ करै मन माहीं।
उन सम कोई जग में नाहिं॥
बहु विधि क्या मैं करौं बड़ाई।
लेय परीक्षा ध्यान लगाई॥
करि विश्वास करैं व्रत नेमा।
होय सिद्ध उपजै उर प्रेमा॥
जय जय जय लक्ष्मी महारानी।
सब में व्यापित जो गुण खानी॥
तुम्हरो तेज प्रबल जग माहीं।
तुम सम कोउ दयाल कहूं नाहीं॥
मोहि अनाथ की सुधि अब लीजै।
संकट काटि भक्ति मोहि दीजे॥
भूल चूक करी क्षमा हमारी।
दर्शन दीजै दशा निहारी॥
बिन दरशन व्याकुल अधिकारी।
तुमहिं अक्षत दुःख सहते भारी॥
नहिं मोहिं ज्ञान बुद्धि है तन में।
सब जानत हो अपने मन में॥
रूप चतुर्भुज करके धारण।
कष्ट मोर अब करहु निवारण॥
कहि प्रकार मैं करौं बड़ाई।
ज्ञान बुद्धि मोहिं नहिं अधिकाई॥
रामदास अब कहाई पुकारी।
करो दूर तुम विपति हमारी॥
 
दोहा
 
त्राहि त्राहि दुःख हारिणी हरो बेगि सब त्रास।
जयति जयति जय लक्ष्मी करो शत्रुन का नाश॥
 
रामदास धरि ध्यान नित विनय करत कर जोर।
मातु लक्ष्मी दास पर करहु दया की कोर॥
 
।। इति लक्ष्मी चालीसा संपूर्णम।।
</pre>`;


// Mantar 
// var mantara=`<h3 class="arti-text-div"> </h3>
// <pre class="theme" id="preTag" >
// </pre>`;

// var mantara=`<h3 class="arti-text-div"> </h3>
// <pre class="theme" id="preTag" >
// </pre>`;

// var mantara=`<h3 class="arti-text-div"> </h3>
// <pre class="theme" id="preTag" >
// </pre>`;

// var mantara=`<h3 class="arti-text-div"> </h3>
// <pre class="theme" id="preTag" >
// </pre>`;

// var mantara=`<h3 class="arti-text-div"> </h3>
// <pre class="theme" id="preTag" >
// </pre>`;

// var mantara=`<h3 class="arti-text-div"> </h3>
// <pre class="theme" id="preTag" >
// </pre>`;

let menuIcon = document.querySelector('#menu-icon');


menuIcon.onclick=()=>{
    document.body
    menuIcon.classList.toggle("bxs-sun");
    document.body.classList.toggle('theme-white');

    // if(document.querySelector("#preTag")!==null){
    //     let preTag = document.querySelector("#preTag");
    //     preTag.classList.toggle('theme-text-white');

    // }
}; 

// function theme(){
//     console.log("hello");
//     const themeid = document.getElementById("themeIcon");
//     themeid.classList.toggle('bxs-sum');
// }


function funShow(valuethis){
    // console.log(valuethis);
    var showArt = document.getElementById("arti");
    var showChalisha = document.getElementById("chalisha");
    var showMantar = document.getElementById("mantar");
   
   
   
   
   
    if(valuethis=='hanuman'){
        // console.log('hanuman');
        showArt.innerHTML=hanumanAarti;
        showChalisha.innerHTML=hanumanChalisha;

    }
    else if(valuethis=='shriganesh')
    {
        showArt.innerHTML=ShriGaneshAarti;
        showChalisha.innerHTML=GaneshChalisha;
       
    }
    else if(valuethis=='shiv'){
        showArt.innerHTML=ShivAarti;
        showChalisha.innerHTML=ShivChalisha;
        
    }
    else if(valuethis=='sarsavati'){
        showArt.innerHTML=sarsavatiAarti;
        showChalisha.innerHTML=sarsawatiChalisha;
    }
    else if(valuethis=='laxami'){
        showArt.innerHTML=laxmiAarti;
        showChalisha.innerHTML=laxmiChalisha;
    }
    else if(valuethis=='duraga'){
        showArt.innerHTML=durgaAarti;
        showChalisha.innerHTML=DuragaChalisha;
    }

}
// for(let i=0; i<allDiv.length;i++){
//     allDiv[i].addEventListener("click",function(){
        
//     });
// }

